app/views/gossip/edit.html.erb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <h1>Modifier mon gossip</h1>
    <p>Modifie ton gossip numéro =°<%= Gossip.find(params[:id]).id %></p>