app/views/gossip/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]
---
<p>Contenu : <%= @gossip.content %></p>
<p>Prénom de l'auteur : <%= @gossip.user.first_name%></p>

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 15]]
---

<% @gossip.comments.each do |comment| %>