app/controllers/comments_controller.rb

  def create
    @gossip = Gossip.find(params[:gossip_id])
    @comment = @gossip.comments.create(comment_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["commenter", "jrezofhezoifz"], ["gossip_id", 2], ["created_at", "2021-02-10 13:59:45.054657"], ["updated_at", "2021-02-10 13:59:45.054657"]]