app/controllers/gossip_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossip = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])
    @comments =  Comment.where(gossip_id: params[:id])

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dzqdz"], ["content", "dzqz"], ["user_id", 44], ["created_at", "2021-02-11 15:53:44.413422"], ["updated_at", "2021-02-11 15:53:44.413422"]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "yousdois"], ["content", "eofizfoieuz"], ["updated_at", "2021-02-10 11:22:19.735409"], ["id", 10]]
---
  def create
    @gossip = Gossip.create(gossip_params)
    @gossip.user = User.find_by(id: session[:user_id])
    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @gossip = Gossip.find(params[:id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "no ffff"], ["content", "sfdsdcc"], ["updated_at", "2021-02-09 15:59:42.674842"], ["id", 4]]
---
  def update
      @gossip = Gossip.find(params[:id])
      if @gossip.update(gossip_params)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 15]]
---
  def destroy
    @gossip = Gossip.find(params[:id])
    @gossip.destroy