app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "test@gmail.com"], ["password_digest", "mdp"], ["created_at", "2021-02-11 08:41:46.703568"], ["updated_at", "2021-02-11 08:41:46.703568"]]
---
  def create
    @user = User.new(user_params)
    @user.save